Информационная_база/src/Catalogs/МероприятияПредприятия/МероприятияПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МероприятияПредприятия</name>
  <attributes>
    <name>ДатаНачалаМероприятия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияМероприятия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеМероприятия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвязаноС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаСвязноС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Информационная_база/src/CommonModules/СоздатьВстерчиПотокиЦиклСозданияВызовСервера/Module.bsl
//@skip-check module-region-empty
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

//@skip-check module-region-empty
#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЦиклСоздания (ПараметрыПроцедуры, ВерхняяГраница) Экспорт	
	
	НачатьТранзакцию();
	Для Сч = 0 По ВерхняяГраница Цикл
		НовоеМероприятие = Справочники.МероприятияПредприятия.СоздатьЭлемент();
		НовоеМероприятие.СвязаноС = ПараметрыПроцедуры[Сч].Наименование;
		НовоеМероприятие.Наименование = ПараметрыПроцедуры[Сч].Наименование;
		НовоеМероприятие.ДатаНачалаМероприятия = ПараметрыПроцедуры[Сч].ДатаНачалаМероприятия;
		НовоеМероприятие.ДатаОкончанияМероприятия = ПараметрыПроцедуры[Сч].ДатаОкончанияМероприятия;
		НовоеМероприятие.СсылкаНаСвязноС = ПараметрыПроцедуры[Сч].Ссылка;
		НовоеМероприятие.Записать();
		
		
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	
	
КонецПроцедуры

#КонецОбласти
